<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"demo","backend":"af9ae60cc01784906a696972897230eea6046f541c663f6684fca5b2cc2a9fc5","plan_job_ref":"Job Terraform #443 at https://github.com/o11y-top/aws-terraform-multiple-environments/actions/runs/4395222100","plan_hash":"d334daa492c57d45a0278c8a26eee1dc6549d8d03324648fa654a4e1bf93c75d","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __demo__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.demo will be created
  + resource "aws_instance" "demo" {
      + ami                                  = "ami-0fd2c44049dd805b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"      = "demo-default"
          + "Owner"     = "rdhar"
          + "Region"    = "us-east-1"
          + "Role"      = "demo"
          + "Terraform" = "default"
        }
      + tags_all                             = {
          + "Name"      = "demo-default"
          + "Owner"     = "rdhar"
          + "Region"    = "us-east-1"
          + "Role"      = "demo"
          + "Terraform" = "default"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform #443](https://github.com/o11y-top/aws-terraform-multiple-environments/actions/runs/4395222100)